; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 605559 2 2 2 8 4
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	spectrograph0 - mode
	spectrograph1 - mode
	Star0 - direction
	Star1 - direction
	Star2 - direction
	Star4 - direction
	GroundStation5 - direction
	Star7 - direction
	GroundStation6 - direction
	Star3 - direction
	Planet8 - direction
	Phenomenon9 - direction
	Phenomenon10 - direction
	Star11 - direction
)
(:init
	(supports instrument0 spectrograph0)
	(calibration_target instrument0 GroundStation6)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation6)
	(supports instrument1 spectrograph0)
	(supports instrument1 spectrograph1)
	(calibration_target instrument1 Star3)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon10)
)
(:goal (and
	(have_image Planet8 spectrograph1)
	(have_image Phenomenon9 spectrograph1)
	(have_image Phenomenon10 spectrograph0)
	(have_image Star11 spectrograph0)
))

)

; plan
1. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 0 of 4
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 4
3. (turn_to satellite1 star3 phenomenon10)
   deleted: (pointing satellite1 phenomenon10)
   added: (pointing satellite1 star3)
   goals met: 0 of 4
4. (turn_to satellite0 star11 groundstation6)
   deleted: (pointing satellite0 groundstation6)
   added: (pointing satellite0 star11)
   goals met: 0 of 4
5. (calibrate satellite1 instrument1 star3)
   added: (calibrated instrument1)
   goals met: 0 of 4
6. (turn_to satellite0 phenomenon10 star11)
   deleted: (pointing satellite0 star11)
   added: (pointing satellite0 phenomenon10)
   goals met: 0 of 4
7. (turn_to satellite1 star11 star3)
   deleted: (pointing satellite1 star3)
   added: (pointing satellite1 star11)
   goals met: 0 of 4
8. (turn_to satellite0 groundstation6 phenomenon10)
   deleted: (pointing satellite0 phenomenon10)
   added: (pointing satellite0 groundstation6)
   goals met: 0 of 4
9. (take_image satellite1 star11 instrument1 spectrograph0)
   added: (have_image star11 spectrograph0)
   goals met: 1 of 4
10. (calibrate satellite0 instrument0 groundstation6)
   added: (calibrated instrument0)
   goals met: 1 of 4
11. (turn_to satellite1 planet8 star11)
   deleted: (pointing satellite1 star11)
   added: (pointing satellite1 planet8)
   goals met: 1 of 4
12. (turn_to satellite0 phenomenon10 groundstation6)
   deleted: (pointing satellite0 groundstation6)
   added: (pointing satellite0 phenomenon10)
   goals met: 1 of 4
13. (take_image satellite1 planet8 instrument1 spectrograph1)
   added: (have_image planet8 spectrograph1)
   goals met: 2 of 4
14. (take_image satellite0 phenomenon10 instrument0 spectrograph0)
   added: (have_image phenomenon10 spectrograph0)
   goals met: 3 of 4
15. (turn_to satellite1 phenomenon9 planet8)
   deleted: (pointing satellite1 planet8)
   added: (pointing satellite1 phenomenon9)
   goals met: 3 of 4
16. (take_image satellite1 phenomenon9 instrument1 spectrograph1)
   added: (have_image phenomenon9 spectrograph1)
   goals met: 4 of 4
